print("""После ядерной войны наступает апокалипсис. 
Люди одичали.Всех привычных нам технологий пришел конец и все человечество вернулось в прошлое. 
Теперь по всей Земле есть маленькие поселения. В своем поселении ты главный. 
Твой народ понимает, что с миром что-то не так. 
Вскоре ты понимаешь, что надвигается тьма, которая поглощает все на своем пути. 
Ты отправляешься в путешествие дабы найти спасение  для своего народа.""")
a = int(input('''На рассвете ты отправляешься...
1. По тропе в лес
2. По тропе в горы
3. Через реку
4. По простой дороге
'''))
while a!=4 or a!=1:
    if a==2:
        print("После сильного дождя и бури, дорогу перекрыло дерево. Ты не можешь пройти по этой дороге!")
        a=int(input('''На рассвете ты отправляешься...
         1. По тропе в лес
         3. Через реку
         4. По простой дороге
         '''))
    elif a==3:
        print("Река очень опасное место, особенно в это время. Не стоит так рисковать жизнью!")    
        a= int(input('''На рассвете ты отправляешься...
        1. По тропе в лес
        2. По тропе в горы
        4. По простой дороге
        '''))
print(' Ты видишь,что тьма подходит все ближе.Ты находишь заброшенный дом. ')
b=int(input(""" 
1.Зайти и поискать что-то нужноe в доме
2.Искать что-то нужное вокруг дома
"""))